In [3]:
from scipy.stats import kstest
from scipy import stats
import pandas as pd
import numpy as np
import seaborn as sns
import chardet
data = '../data/'

Nous avons plusieurs datasets
    Elasticity 
    Gini 
    Revenue

In [4]:
world = pd.read_csv(data + "world_country.csv")
baseCountry = world[['name','alpha-3']]
baseCountry = baseCountry.rename(columns={'alpha-3': 'iso'})
baseCountry

                  name  iso
0          Afghanistan  AFG
1        Åland Islands  ALA
2              Albania  ALB
3              Algeria  DZA
4       American Samoa  ASM
..                 ...  ...
244  Wallis and Futuna  WLF
245     Western Sahara  ESH
246              Yemen  YEM
247             Zambia  ZMB
248           Zimbabwe  ZWE

[249 rows x 2 columns]

In [5]:
incomes = pd.read_csv(data + "worldincome.csv", parse_dates=True)
#baseCountry = baseCountry.rename(columns={'country': 'iso'})
incomes.describe()
incomes

      country  year_survey  quantile  nb_quantiles     income     gdpppp
0         ALB         2008         1           100  728,89795       7297
1         ALB         2008         2           100  916,66235       7297
2         ALB         2008         3           100   1010,916       7297
3         ALB         2008         4           100  1086,9078       7297
4         ALB         2008         5           100  1132,6997       7297
...       ...          ...       ...           ...        ...        ...
11594     COD         2008        96           100   810,6233  303,19305
11595     COD         2008        97           100   911,7834  303,19305
11596     COD         2008        98           100  1057,8074  303,19305
11597     COD         2008        99           100  1286,6029  303,19305
11598     COD         2008       100           100  2243,1226  303,19305

[11599 rows x 6 columns]

In [6]:
incomes["year_survey"].unique() # timeline in df

array([2008, 2009, 2010, 2007, 2006, 2011, 2004])

In [7]:
representCountry = len(incomes)
totalCountriesInWorld = 195
populationCoveradeByDf = (representCountry / totalCountriesInWorld) * 100
populationCoveradeByDf

5948.205128205128

On resence 195 pays dans le monde le dataset représente 160 pays nous avons 59% qui sont représenter dans le dataset

nous allons clear le dataset voir si il y a des valeurs manquantes etc ..

In [8]:
dfDate = incomes.copy()
dfDate.drop_duplicates(subset='year_survey', keep='first',inplace=True)
dfDate.sort_values(by='year_survey') # la frise chrnologique commence en 2004 et fini en 2011 il manque les donnée de 2005

     country  year_survey  quantile  nb_quantiles     income     gdpppp
9899     SYR         2004         1           100  143,18066       4512
3600     GHA         2006         1           100  63,157047  1380,1182
900      BIH         2007         1           100   808,3991       7472
0        ALB         2008         1           100  728,89795       7297
600      BFA         2009         1           100  138,40517  1085,5139
700      BGD         2010         1           100  276,93503       1233
3900     GTM         2011         1           100  38,463615       4367

In [ ]:
incomes.info()

In [9]:
incomes.replace(',','.', regex=True, inplace=True)
incomes['income'] = incomes['income'].astype(float)
incomes['gdpppp'] = incomes['gdpppp'].astype(float)

In [23]:
incomes[incomes['country']=='ALB'].sort_values(by='income') # j'ai pris le premiers pays du dataset pour connaitre le nombre de quantile 
## nb quantiles toujours = 100

   country  year_survey  quantile  nb_quantiles       income  gdpppp
0      ALB         2008         1           100    728.89795  7297.0
1      ALB         2008         2           100    916.66235  7297.0
2      ALB         2008         3           100   1010.91600  7297.0
3      ALB         2008         4           100   1086.90780  7297.0
4      ALB         2008         5           100   1132.69970  7297.0
..     ...          ...       ...           ...          ...     ...
95     ALB         2008        96           100   6231.09960  7297.0
96     ALB         2008        97           100   6822.31840  7297.0
97     ALB         2008        98           100   7775.89100  7297.0
98     ALB         2008        99           100   9351.75100  7297.0
99     ALB         2008       100           100  17754.32400  7297.0

[100 rows x 6 columns]

In [11]:
numberOfCountry = incomes.groupby('country')
numberOfCountry.count() # nb pays

         year_survey  quantile  nb_quantiles  income  gdpppp
country
ALB              100       100           100     100     100
ARG              100       100           100     100     100
ARM              100       100           100     100     100
AUT              100       100           100     100     100
AZE              100       100           100     100     100
...              ...       ...           ...     ...     ...
VEN              100       100           100     100     100
VNM              100       100           100     100     100
XKX              100       100           100     100       0
YEM              100       100           100     100     100
ZAF              100       100           100     100     100

[116 rows x 5 columns]

In [12]:
incomes.count() ## si il y a 116 il manque une ligne

country         11599
year_survey     11599
quantile        11599
nb_quantiles    11599
income          11599
gdpppp          11399
dtype: int64

In [13]:
countQuantile = incomes.pivot_table(index='country').sort_values(by='quantile').reset_index()[['country', 'quantile']]
diffQuantile = countQuantile[countQuantile['quantile'] != 50.50000]
diffQuantile ## quantile manquant

    country  quantile
115     LTU  50.59596

In [14]:
ltu = incomes[incomes['country']=='LTU']
## voir la ligne manquante 
##https://www.appsloveworld.com/numpy/100/21/check-the-missing-integers-from-a-range-in-python
missedQuantile = np.setdiff1d(list(range(1, 101)), list(ltu['quantile']))

missedQuantile

array([41])

In [15]:
if len(missedQuantile) != 0: 
    ## on fait une moyenne de ces deux valeurs 
    getRowsLtu = ltu[ltu['quantile'].isin([missedQuantile[0]-1,missedQuantile[0]+1])]
    getRowsLtu
    ## creation de la row 
    meanRowLtu = getRowsLtu.pivot_table(index='country').reset_index()
    ## insérer la row manquante
    incomes = pd.concat([incomes, meanRowLtu]).reset_index().drop(columns='index')

In [16]:
## valeur manquantes gdppppp
showMissGdp = incomes[incomes['gdpppp'].isnull()]
showMissGdp

percentDataMissing = round(len(showMissGdp) / len(incomes) * 100, 1) 
percentDataMissing # les valeurs manquantes gdpppp represente 1.7 % du dataset on décide de les supprimer

showMissGdp

      country  year_survey  quantile  nb_quantiles      income  gdpppp
5800      XKX         2008         1           100   437.89370     NaN
5801      XKX         2008         2           100   508.17133     NaN
5802      XKX         2008         3           100   591.82820     NaN
5803      XKX         2008         4           100   668.00000     NaN
5804      XKX         2008         5           100   730.40220     NaN
...       ...          ...       ...           ...         ...     ...
11294     PSE         2009        96           100  2763.88480     NaN
11295     PSE         2009        97           100  3077.83330     NaN
11296     PSE         2009        98           100  3449.22240     NaN
11297     PSE         2009        99           100  4165.99700     NaN
11298     PSE         2009       100           100  6343.87550     NaN

[200 rows x 6 columns]

In [17]:
if showMissGdp['gdpppp'].isnull().sum() > 0:
    incomes.drop(showMissGdp.index, inplace=True)

In [18]:
## on enregistre le dataset clear pour la suite de nos exercices

In [19]:
incomes.reset_index()
incomes.to_csv(data+ 'worldincome_clear.csv', index=False)
incomes

      country  year_survey  quantile  nb_quantiles      income       gdpppp
0         ALB         2008         1           100   728.89795   7297.00000
1         ALB         2008         2           100   916.66235   7297.00000
2         ALB         2008         3           100  1010.91600   7297.00000
3         ALB         2008         4           100  1086.90780   7297.00000
4         ALB         2008         5           100  1132.69970   7297.00000
...       ...          ...       ...           ...         ...          ...
11595     COD         2008        97           100   911.78340    303.19305
11596     COD         2008        98           100  1057.80740    303.19305
11597     COD         2008        99           100  1286.60290    303.19305
11598     COD         2008       100           100  2243.12260    303.19305
11599     LTU         2008        41           100  4882.14065  17571.00000

[11400 rows x 6 columns]

#  DATA GINI

In [60]:
giniFile = data + "API_SI.POV.GINI_DS2.csv";
gini = pd.read_csv(giniFile)
df = gini.copy()
gini

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,Unnamed: 66
0,Aruba,ABW,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Africa Western and Central,AFW,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,AGO,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,51.3,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Kosovo,XKX,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,26.3,27.3,26.5,26.7,29.0,NaN,NaN,NaN,NaN,NaN
262,"Yemen, Rep.",YEM,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,36.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
263,South Africa,ZAF,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,63.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
264,Zambia,ZMB,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,57.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
265,Zimbabwe,ZWE,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,44.3,NaN,50.3,NaN,NaN,NaN

In [61]:
def transform_columns_to_date(df, start_year=1960, end_year=2022):
    # Sélectionner les colonnes d'années
    year_cols = df.filter(regex='^(19[6-9][0-9]|20[0-2][0-2])$')  # Expression régulière pour les années de 1960 à 2022
    
    # Convertir les colonnes d'années en lignes
    df_long = pd.melt(df, id_vars=df.columns.difference(year_cols.columns), value_vars=year_cols.columns, var_name='year', value_name='value')
    
    # Créer une colonne "date" à partir de la colonne "year"
    df_long['date'] = pd.to_datetime(df_long['year'], format='%Y').dt.year
    
    # Supprimer la colonne "year"
    df_long = df_long.drop('year', axis=1)
    
    return df_long

In [75]:
newGini = transform_columns_to_date(df)
newGini = newGini[['Country Name', 'Country Code', 'date',"value"]]
newGini.dropna(subset=['value'], inplace=True)
newGini = newGini.rename(columns={'value': 'indice_gini'})
newGini = newGini.sort_values(by=['Country Name']).reset_index()
newGini = newGini.drop(['index'], axis=1)

newGini

    Country Name Country Code  date  indice_gini
0        Albania          ALB  1996         27.0
1        Albania          ALB  2002         31.7
2        Albania          ALB  2012         29.0
3        Algeria          DZA  2011         27.6
4        Algeria          DZA  1988         40.2
..           ...          ...   ...          ...
781       Zambia          ZMB  1991         60.5
782       Zambia          ZMB  1996         48.3
783       Zambia          ZMB  1993         52.6
784       Zambia          ZMB  1998         49.1
785     Zimbabwe          ZWE  2011         43.2

[786 rows x 4 columns]

In [71]:
newGini.loc[newGini['Country Code'] == 'AUT']

    Country Name Country Code  date  indice_gini
61       Austria          AUT  1987         23.0
192      Austria          AUT  1994         31.3
219      Austria          AUT  1995         31.1
285      Austria          AUT  1997         30.2
383      Austria          AUT  2000         28.8
521      Austria          AUT  2010         30.3
604      Austria          AUT  2011         30.8
683      Austria          AUT  2012         30.5

In [65]:
# regarder si il y a des pays manquants danss le dataframe 

missingCountriesGini = ~np.isin(baseCountry['iso'].values, newGini['Country Code'].values)


baseCountry.loc[missingCountriesGini,'iso']

0      AFG
1      ALA
4      ASM
5      AND
7      AIA
      ...
236    UMI
242    VGB
243    VIR
244    WLF
245    ESH
Name: iso, Length: 95, dtype: object

In [67]:
valeurs_colonne_specifique = np.unique(newGini["Country Code"].values)

# Vérifier si les valeurs de la colonne spécifique de df1 sont présentes dans valeurs_colonne_specifique
valeurs_manquantes = np.isin(baseCountry["iso"].values, valeurs_colonne_specifique)

nb_valeurs_manquantes = np.count_nonzero(~valeurs_manquantes)


nb_valeurs_manquantes

95